
var geoCoordMap = {
"北京市": [116.378173828125, 39.90973623453719],
"天津市":[
  117.19802856445311,
  39.12366825402605
],
"河北省": [
  114.4830322265625,
  38.06971703320484
],
"山西省":[
  112.52197265625,
  37.89219554724437
],
"四川省":[
  104.07,
  30.67
],
"内蒙古自治区":[
  111.67877197265624,
  40.84706035607122
],
"辽宁省":[
  123.4423828125,
  41.832735062152615
],
"吉林省":[
  125.3045654296875,
  43.88997537383687
],
"黑龙江省":[
  126.6448974609375,
  45.763690956618674
],
"上海市": [
  121.46209716796875,
  31.228068791512136
],
"江苏省":[
  118.79241943359374,
  32.05231681645636
],
"浙江省":[
  120.13824462890625,
  30.300575007090888
],
"安徽省":[
  117.25982666015624,
  31.861229825930895
],
"福建省":[
  119.30328369140624,
  26.07652055985697
],
"江西省": [
  115.87005615234375,
  28.680949728554964
],
"山东省":[
  117.12524414062501,
  36.66841891894786
],
"河南省": [
  113.6480712890625,
  34.77771580360469
],
"湖北省":[
  114.3017578125,
  30.62373195163005
],
"湖南省":[
  112.99850463867188,
  28.199136859968778
],
"广东省":[
  113.291015625,
  23.14541110372829
],
"广西壮族自治区":[
  108.30047607421875,
  22.842008398595794
],
"重庆市":[
  106.50146484374999,
  29.592565403314087
],
"贵州省":[
  106.69921875,
  26.60817437403311
],
"云南省":[
  102.72491455078125,
  25.05076877966861
],
"西藏自治区":[
  91.131591796875,
  29.663592747483726
],
"甘肃省":[
  103.83316040039062,
  36.05742594589385
],
"青海省":[
  101.76567077636719,
  36.64638529597495
],
"新疆维吾尔自治区":[
  87.60086059570312,
  43.807774213873806
],
"台湾省": [
  121.56372070312499,
  25.045792240303445
],
"香港特别行政区":[
  114.1754150390625,
  22.32721165838893
],
"澳门特别行政区": [
  113.56155395507812,
  22.151795575397756
],
}
//拼接对象数组
var convertData = function (data) {
var res = [];
for (var i = 0; i < data.length; i++) {
  var geoCoord = geoCoordMap[data[i].name];//获取坐标
  if (geoCoord) {//如果有坐标
      res.push({//创建对象数组，
          name: data[i].name,
          value: geoCoord.concat(Number(data[i].count))  //用连接数组的形式将value值加入
      })
  }
}
console.log(res)
return res;
}
export default {
tooltip: {
  trigger: 'item',
  showDelay: 0,
  transitionDuration: 0.2,
  formatter: function (params) {
      var value = (params.value[2] + '').split('.');
      return '申请单数量' + '<br/>'+ params.name + ':' + value + '单';
  }
},
legend: {
  show: false,
  orient: 'vertical',
  left: 'left',
  data:['']
},
visualMap: {
  min: 0,
  max: 100,
  left: 'left',
  top: 'bottom',
  text: ['高', '低'], // 文本，默认为数值文本
  calculable: true,
  show: false,
  inRange: {
      color: ['#FFCC00', '#FFCC00', '#FFCC00']
  }
},
geo: {
  map: 'china',
  label: {
      normal: {
          show: false
      },
      emphasis: {
          show: false
      }
  },
  itemStyle: {
      //未激活样式
      normal: {
          areaColor: '#337BFF',
          borderColor: '#111'
      },
      //激活样式
      emphasis: {
          areaColor: '#e6a23c'
      }
  }
},
selectedMode: 'single',
series : [
  {
      name: '申请单数',
      type: 'scatter',
      coordinateSystem: 'geo',
      data: convertData(mapData),
      symbolSize: function (val,params) {
          if (val[2]>1000) {
              return 15
          } else if (val[2]>100 && val[2] < 1000) {
              return 10
          }
          else {
              return 5
          }
      },
      label: {
          normal: {
              show: false
          },
          emphasis: {
              show: false
          }
      }
  }
]
}
